{
  "_meta": {
    "models": {
      "categories": "Four skill categories representing different dimensions of product work."
    }
  },
  "categories": [
    {
      "id": "product",
      "title": "Product",
      "color": "amber",
      "skills": [
        {
          "title": "Discovery & User Research",
          "description": "Talked to 20+ engineers before building PrepGPT. Ran discovery sessions at Rivo, mapped end-to-end workflows, found 4 critical handoff gaps. PRDs came after understanding real friction."
        },
        {
          "title": "PRDs & Roadmapping",
          "description": "Wrote PRDs targeting gaps first. Set phased roadmaps (visibility → reliability → productivity → AI) to sequence releases without overloading teams."
        },
        {
          "title": "Prioritization & Scoping",
          "description": "Faced timeline pressure for more features. Recognized only core flow would move conversion. Cut scope to essentials, shipped on time."
        },
        {
          "title": "A/B Testing & Journey Mapping",
          "description": "Found retention drop-off was concentrated in onboarding at HealthifyMe. Redesigned flow to get users to first value faster. 15% retention lift."
        }
      ]
    },
    {
      "id": "ai",
      "title": "AI & LLMs",
      "color": "amber",
      "skills": [
        {
          "title": "RAG Systems",
          "description": "Built PrepGPT with RAG for retrieval. Made explicit build vs buy decisions on each component to ship faster."
        },
        {
          "title": "LLM Integration",
          "description": "Designed AskRivo, an AI chatbot that walks users through rent vs buy tradeoff before pushing products — addressing the real decision blocker upstream."
        },
        {
          "title": "Agents & Eval Loops",
          "description": "PrepGPT used agents for conversational practice and eval loops for personalized feedback. Session recordings confirmed users returned for feedback, not content."
        },
        {
          "title": "Embeddings",
          "description": "Hands-on experience with embeddings for semantic search and matching. Built systems where AI reduces cognitive load and removes repetition."
        }
      ]
    },
    {
      "id": "tech",
      "title": "Tech",
      "color": "amber",
      "skills": [
        {
          "title": "Python & Django",
          "description": "Core backend stack. Built reliable systems at HealthifyMe and Attentive OS. Work close to systems and data flows to make grounded product decisions."
        },
        {
          "title": "SQL · Redis · MySQL",
          "description": "Led Redis caching and MySQL partitioning at HealthifyMe. 4x faster response times, 10% cloud cost reduction. 80% of gains with 20% of effort."
        },
        {
          "title": "AWS & Microservices",
          "description": "Production experience with AWS infrastructure. Prefer simple, predictable architectures that scale without unnecessary complexity."
        },
        {
          "title": "APIs & Integrations",
          "description": "Drove API integration decisions at Attentive OS. Shipped proposal engine that became a key selling point."
        }
      ]
    },
    {
      "id": "leadership",
      "title": "Leadership",
      "color": "amber",
      "skills": [
        {
          "title": "Cross-Functional Alignment",
          "description": "Engineering, design, and sales were building independent mental models at Attentive. Instituted weekly syncs. Sales started selling what we were actually building."
        },
        {
          "title": "Stakeholder Management",
          "description": "Faced timeline pressure from stakeholders pushing for more features. Recognized what would actually impact conversion. Delivered what specialists needed."
        },
        {
          "title": "Mentorship",
          "description": "Mentored 4 engineers at Attentive OS. Connected technical execution to measurable business value across teams."
        },
        {
          "title": "0→1 Ownership",
          "description": "Co-founded PrepGPT. First PM at Rivo. Built Shift Management from pitch to production. I thrive when the playbook doesn't exist yet."
        }
      ]
    }
  ]
}