{
  "_meta": {
    "models": {
      "categories": "Four skill categories representing different dimensions of product work."
    }
  },
  "categories": [
    {
      "id": "product",
      "title": "Product",
      "color": "stone",
      "skills": [
        {
          "title": "Product Strategy & Roadmapping",
          "description": "I prioritise using RICE, MoSCoW, and effort-vs-impact — so decisions stay rational, not intuition-driven."
        },
        {
          "title": "0→1 Product Execution",
          "description": "Built the IIT Jammu electricity analytics panel (B2B) from idea → workflows → shipped version used by campus stakeholders."
        },
        {
          "title": "Problem Framing & PRDs",
          "description": "I anchor decisions on the user problem, constraints, and context — solutions only come after clarity."
        },
        {
          "title": "Execution Under Constraints",
          "description": "I focus on fast loops and first value — shipping progress instead of chasing perfect scope."
        }
      ]
    },
    {
      "id": "ai",
      "title": "AI",
      "color": "blue",
      "skills": [
        {
          "title": "LLM-powered Workflows — TalentKnct",
          "description": "Used AI inside real user workflows — improving relevance and reducing manual effort instead of adding \"AI for the sake of AI.\""
        },
        {
          "title": "AI in My PM Workflow — Vibe Coding",
          "description": "I work with AI across research, writing, and iteration — treating it as a thinking partner, not just a tool."
        },
        {
          "title": "Prompt & Behaviour Design",
          "description": "I treat prompts like product levers — small changes reshape outcomes, flow, and user experience."
        },
        {
          "title": "Human-in-the-Loop Decisions",
          "description": "I design AI to support judgment in decision workflows — not replace it blindly."
        }
      ]
    },
    {
      "id": "tech",
      "title": "Tech",
      "color": "amber",
      "skills": [
        {
          "title": "Backend Systems · Python · Django",
          "description": "Comfortable working close to systems — where reliability, clarity, and maintainability matter."
        },
        {
          "title": "Redis · Caching · Performance",
          "description": "Improved real-world performance through caching patterns and access-path optimisation at scale."
        },
        {
          "title": "System Design & APIs",
          "description": "Prefer simple, predictable architectures that scale without unnecessary complexity."
        },
        {
          "title": "Infra Awareness · AWS & Cost Sensitivity",
          "description": "Treat infra choices as business choices — cost, stability, and user trust stay connected."
        }
      ]
    },
    {
      "id": "user",
      "title": "User & Soft Skills",
      "color": "green",
      "skills": [
        {
          "title": "User Surveys & Research — Airtribe",
          "description": "Ran structured surveys and conversations to uncover real learner friction — turning signals into clear product direction."
        },
        {
          "title": "Creative Problem-Solving at Speed",
          "description": "I explore options fast, test early, and converge on the solution that actually works in context."
        },
        {
          "title": "Strong, Direct Communication",
          "description": "I share context, constraints, and decisions openly — helping teams move in one direction with confidence."
        },
        {
          "title": "Ownership & Action-Driven Mindset",
          "description": "I take problems end-to-end — ship first value, refine with feedback, and scale with intention."
        }
      ]
    }
  ]
}