{
  "_meta": {
    "models": {
      "background": "Your origin story — what sparked your curiosity and shaped your path from human psychology to systems thinking.",
      "education": "Your academic journey and formal learning experiences that built your foundation.",
      "experience": "Places you've worked and the impact you've made — engineering with business context."
    },
    "relationships": [
      "Background sets the context for why you chose your education path",
      "Education provides the foundation that enabled your experience",
      "Experience builds toward your current role and future direction"
    ]
  },
  "background": {
    "title": "Journey",
    "points": [
      "I've always been curious about how people think, decide, and behave.\nThat curiosity pulled me toward problem-solving, systems, and decision-loops — not just code.",
      "At IIT, I started seeing patterns in behaviour, systems, and technology.\nTech became less about features, and more about how decisions are made, repeated, and improved.",
      "Over time, I realised my work sits at the intersection of\npeople · product · engineering —\nand I enjoy building where technology reduces friction and improves real-world outcomes."
    ]
  },
  "education": {
    "title": "Education",
    "items": [
      {
        "institution": "IIT Jammu",
        "degree": "B.Tech, Computer Science",
        "years": "Aug 2016 – May 2020",
        "description": "Built foundations in systems, scalability, and first-principles problem-solving.\nLearned to break complexity into clear, actionable product and technical decisions."
      }
    ]
  },
  "experience": {
    "title": "Experience",
    "items": [
      {
        "company": "HealthifyMe",
        "role": "Software Engineer",
        "years": "Mar 2021 – Dec 2023",
        "description": "Built reliable, cost-optimised backend systems — caching, Redis pipelines, infra optimisation.\n**4× faster** response times and **~10% lower cloud costs**, while keeping systems stable and compliant."
      },
      {
        "company": "Attentive OS",
        "role": "Software Engineer II",
        "years": "Mar 2023 – Oct 2024",
        "description": "Co-led platform architecture and built a dynamic proposal engine.\nReduced manual effort by **~25%** and aligned engineering + product around roadmap outcomes.\nConnected **technical execution → measurable business value** across teams."
      },
      {
        "company": "CoinedOne",
        "role": "PM Intern (AI-First, Mortgage Ops · Rivo)",
        "years": "Oct 2025 – Present",
        "description": "Designed the Rivo OS workflow for mortgage specialists, focusing on review, triage, and decision checkpoints.\nRemoved duplicate inputs and unnecessary handoffs — **~30% reduction** in effort per case.\n**Fewer steps. Faster decisions. Higher case-throughput** across the team."
      }
    ]
  }
}